RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S06/LPC55S06/LPC55S06.h
#define PUF_SRAM_CTRL_STATUS_READY_MASK          (0x1U)
#define PUF_SRAM_CTRL_STATUS_READY_SHIFT         (0U)
/*! READY - PUF SRAM Controller State
 */
#define PUF_SRAM_CTRL_STATUS_READY(x)            (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_STATUS_READY_SHIFT)) & PUF_SRAM_CTRL_STATUS_READY_MASK)
/*! @} */

/*! @name INT_CLR_ENABLE - Interrupt Enable Clear Register */
/*! @{ */

#define PUF_SRAM_CTRL_INT_CLR_ENABLE_READY_MASK  (0x1U)
#define PUF_SRAM_CTRL_INT_CLR_ENABLE_READY_SHIFT (0U)
/*! READY - READY Interrupt Enable clear
 */
#define PUF_SRAM_CTRL_INT_CLR_ENABLE_READY(x)    (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_CLR_ENABLE_READY_SHIFT)) & PUF_SRAM_CTRL_INT_CLR_ENABLE_READY_MASK)

#define PUF_SRAM_CTRL_INT_CLR_ENABLE_APB_ERR_MASK (0x2U)
#define PUF_SRAM_CTRL_INT_CLR_ENABLE_APB_ERR_SHIFT (1U)
/*! APB_ERR - APB_ERR Interrupt Enable clear
 */
#define PUF_SRAM_CTRL_INT_CLR_ENABLE_APB_ERR(x)  (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_CLR_ENABLE_APB_ERR_SHIFT)) & PUF_SRAM_CTRL_INT_CLR_ENABLE_APB_ERR_MASK)
/*! @} */

/*! @name INT_SET_ENABLE - Interrupt Enable Set Register */
/*! @{ */

#define PUF_SRAM_CTRL_INT_SET_ENABLE_READY_MASK  (0x1U)
#define PUF_SRAM_CTRL_INT_SET_ENABLE_READY_SHIFT (0U)
/*! READY - READY Interrupt Enable set
 */
#define PUF_SRAM_CTRL_INT_SET_ENABLE_READY(x)    (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_SET_ENABLE_READY_SHIFT)) & PUF_SRAM_CTRL_INT_SET_ENABLE_READY_MASK)

#define PUF_SRAM_CTRL_INT_SET_ENABLE_APB_ERR_MASK (0x2U)
#define PUF_SRAM_CTRL_INT_SET_ENABLE_APB_ERR_SHIFT (1U)
/*! APB_ERR - APB_ERR Interrupt Enable set
 */
#define PUF_SRAM_CTRL_INT_SET_ENABLE_APB_ERR(x)  (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_SET_ENABLE_APB_ERR_SHIFT)) & PUF_SRAM_CTRL_INT_SET_ENABLE_APB_ERR_MASK)
/*! @} */

/*! @name INT_STATUS - Interrupt Status Register */
/*! @{ */

#define PUF_SRAM_CTRL_INT_STATUS_READY_MASK      (0x1U)
#define PUF_SRAM_CTRL_INT_STATUS_READY_SHIFT     (0U)
/*! READY - READY Interrupt Status
 */
#define PUF_SRAM_CTRL_INT_STATUS_READY(x)        (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_STATUS_READY_SHIFT)) & PUF_SRAM_CTRL_INT_STATUS_READY_MASK)

#define PUF_SRAM_CTRL_INT_STATUS_APB_ERR_MASK    (0x2U)
#define PUF_SRAM_CTRL_INT_STATUS_APB_ERR_SHIFT   (1U)
/*! APB_ERR - APB_ERR Interrupt Status
 */
#define PUF_SRAM_CTRL_INT_STATUS_APB_ERR(x)      (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_STATUS_APB_ERR_SHIFT)) & PUF_SRAM_CTRL_INT_STATUS_APB_ERR_MASK)
/*! @} */

/*! @name INT_ENABLE - Interrupt Enable Register */
/*! @{ */

#define PUF_SRAM_CTRL_INT_ENABLE_READY_MASK      (0x1U)
#define PUF_SRAM_CTRL_INT_ENABLE_READY_SHIFT     (0U)
/*! READY - READY Interrupt Enable
 */
#define PUF_SRAM_CTRL_INT_ENABLE_READY(x)        (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_ENABLE_READY_SHIFT)) & PUF_SRAM_CTRL_INT_ENABLE_READY_MASK)

#define PUF_SRAM_CTRL_INT_ENABLE_APB_ERR_MASK    (0x2U)
#define PUF_SRAM_CTRL_INT_ENABLE_APB_ERR_SHIFT   (1U)
/*! APB_ERR - APB_ERR Interrupt Enable
 */
#define PUF_SRAM_CTRL_INT_ENABLE_APB_ERR(x)      (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_ENABLE_APB_ERR_SHIFT)) & PUF_SRAM_CTRL_INT_ENABLE_APB_ERR_MASK)
/*! @} */

/*! @name INT_CLR_STATUS - Interrupt Status Clear Register */
/*! @{ */

#define PUF_SRAM_CTRL_INT_CLR_STATUS_READY_MASK  (0x1U)
#define PUF_SRAM_CTRL_INT_CLR_STATUS_READY_SHIFT (0U)
/*! READY - READY Interrupt Status clear
 */
#define PUF_SRAM_CTRL_INT_CLR_STATUS_READY(x)    (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_CLR_STATUS_READY_SHIFT)) & PUF_SRAM_CTRL_INT_CLR_STATUS_READY_MASK)

#define PUF_SRAM_CTRL_INT_CLR_STATUS_APB_ERR_MASK (0x2U)
#define PUF_SRAM_CTRL_INT_CLR_STATUS_APB_ERR_SHIFT (1U)
/*! APB_ERR - APB_ERR Interrupt Status Clear
 */
#define PUF_SRAM_CTRL_INT_CLR_STATUS_APB_ERR(x)  (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_CLR_STATUS_APB_ERR_SHIFT)) & PUF_SRAM_CTRL_INT_CLR_STATUS_APB_ERR_MASK)
/*! @} */

/*! @name INT_SET_STATUS - Interrupt Status set */
/*! @{ */

#define PUF_SRAM_CTRL_INT_SET_STATUS_READY_MASK  (0x1U)
#define PUF_SRAM_CTRL_INT_SET_STATUS_READY_SHIFT (0U)
/*! READY - READY Interrupt Status set
 */
#define PUF_SRAM_CTRL_INT_SET_STATUS_READY(x)    (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_SET_STATUS_READY_SHIFT)) & PUF_SRAM_CTRL_INT_SET_STATUS_READY_MASK)

#define PUF_SRAM_CTRL_INT_SET_STATUS_APB_ERR_MASK (0x2U)
#define PUF_SRAM_CTRL_INT_SET_STATUS_APB_ERR_SHIFT (1U)
/*! APB_ERR - APB_ERR Interrupt Status Set
 */
#define PUF_SRAM_CTRL_INT_SET_STATUS_APB_ERR(x)  (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_INT_SET_STATUS_APB_ERR_SHIFT)) & PUF_SRAM_CTRL_INT_SET_STATUS_APB_ERR_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PUF_SRAM_CTRL_Register_Masks */


/* PUF_SRAM_CTRL - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PUF_SRAM_CTRL base address */
  #define PUF_SRAM_CTRL_BASE                       (0x5003B000u)
  /** Peripheral PUF_SRAM_CTRL base address */
  #define PUF_SRAM_CTRL_BASE_NS                    (0x4003B000u)
  /** Peripheral PUF_SRAM_CTRL base pointer */
  #define PUF_SRAM_CTRL                            ((PUF_SRAM_CTRL_Type *)PUF_SRAM_CTRL_BASE)
  /** Peripheral PUF_SRAM_CTRL base pointer */
  #define PUF_SRAM_CTRL_NS                         ((PUF_SRAM_CTRL_Type *)PUF_SRAM_CTRL_BASE_NS)
  /** Array initializer of PUF_SRAM_CTRL peripheral base addresses */
  #define PUF_SRAM_CTRL_BASE_ADDRS                 { PUF_SRAM_CTRL_BASE }
  /** Array initializer of PUF_SRAM_CTRL peripheral base pointers */
  #define PUF_SRAM_CTRL_BASE_PTRS                  { PUF_SRAM_CTRL }
  /** Array initializer of PUF_SRAM_CTRL peripheral base addresses */
  #define PUF_SRAM_CTRL_BASE_ADDRS_NS              { PUF_SRAM_CTRL_BASE_NS }
  /** Array initializer of PUF_SRAM_CTRL peripheral base pointers */
  #define PUF_SRAM_CTRL_BASE_PTRS_NS               { PUF_SRAM_CTRL_NS }
#else
  /** Peripheral PUF_SRAM_CTRL base address */
  #define PUF_SRAM_CTRL_BASE                       (0x4003B000u)
  /** Peripheral PUF_SRAM_CTRL base pointer */
  #define PUF_SRAM_CTRL                            ((PUF_SRAM_CTRL_Type *)PUF_SRAM_CTRL_BASE)
  /** Array initializer of PUF_SRAM_CTRL peripheral base addresses */
  #define PUF_SRAM_CTRL_BASE_ADDRS                 { PUF_SRAM_CTRL_BASE }
  /** Array initializer of PUF_SRAM_CTRL peripheral base pointers */
  #define PUF_SRAM_CTRL_BASE_PTRS                  { PUF_SRAM_CTRL }
#endif

/*!
 * @}
 */ /* end of group PUF_SRAM_CTRL_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RNG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RNG_Peripheral_Access_Layer RNG Peripheral Access Layer
 * @{
 */

/** RNG - Register Layout Typedef */
typedef struct {
  __I  uint32_t RANDOM_NUMBER;                     /**< This register contains a random 32 bit number which is computed on demand, at each time it is read, offset: 0x0 */
  __IO uint32_t ENCRYPTED_NUMBER;                  /**< This register contains a random 32 bit number which is pre-computed, offset: 0x4 */
  __I  uint32_t COUNTER_VAL;                       /**< , offset: 0x8 */
  __IO uint32_t COUNTER_CFG;                       /**< , offset: 0xC */
  __IO uint32_t ONLINE_TEST_CFG;                   /**< , offset: 0x10 */
  __I  uint32_t ONLINE_TEST_VAL;                   /**< , offset: 0x14 */
  __IO uint32_t ENTROPY_INJECT;                    /**< , offset: 0x18 */
  __IO uint32_t MISC_CFG;                          /**< , offset: 0x1C */
       uint8_t RESERVED_0[4052];
  __IO uint32_t POWERDOWN;                         /**< Powerdown mode (standard but certainly useless here), offset: 0xFF4 */
       uint8_t RESERVED_1[4];
  __I  uint32_t MODULEID;                          /**< IP identifier, offset: 0xFFC */
} RNG_Type;

/* ----------------------------------------------------------------------------
   -- RNG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RNG_Register_Masks RNG Register Masks
 * @{
 */

/*! @name RANDOM_NUMBER - This register contains a random 32 bit number which is computed on demand, at each time it is read */
/*! @{ */

#define RNG_RANDOM_NUMBER_RANDOM_NUMBER_MASK     (0xFFFFFFFFU)
#define RNG_RANDOM_NUMBER_RANDOM_NUMBER_SHIFT    (0U)
/*! RANDOM_NUMBER - This register contains a random 32 bit number which is computed on demand, at each time it is read.
 */
#define RNG_RANDOM_NUMBER_RANDOM_NUMBER(x)       (((uint32_t)(((uint32_t)(x)) << RNG_RANDOM_NUMBER_RANDOM_NUMBER_SHIFT)) & RNG_RANDOM_NUMBER_RANDOM_NUMBER_MASK)
/*! @} */

/*! @name ENCRYPTED_NUMBER - This register contains a random 32 bit number which is pre-computed */
/*! @{ */

#define RNG_ENCRYPTED_NUMBER_ENCRYPTED_NUMBER_MASK (0xFFFFFFFFU)
#define RNG_ENCRYPTED_NUMBER_ENCRYPTED_NUMBER_SHIFT (0U)
/*! ENCRYPTED_NUMBER - This register contains a random 32 bit number which is pre-computed.
 */
#define RNG_ENCRYPTED_NUMBER_ENCRYPTED_NUMBER(x) (((uint32_t)(((uint32_t)(x)) << RNG_ENCRYPTED_NUMBER_ENCRYPTED_NUMBER_SHIFT)) & RNG_ENCRYPTED_NUMBER_ENCRYPTED_NUMBER_MASK)
/*! @} */

/*! @name COUNTER_VAL -  */
/*! @{ */

#define RNG_COUNTER_VAL_CLK_RATIO_MASK           (0xFFU)
#define RNG_COUNTER_VAL_CLK_RATIO_SHIFT          (0U)
/*! CLK_RATIO - Gives the ratio between the internal clocks frequencies and the register clock
 *    frequency for evaluation and certification purposes.
 */
#define RNG_COUNTER_VAL_CLK_RATIO(x)             (((uint32_t)(((uint32_t)(x)) << RNG_COUNTER_VAL_CLK_RATIO_SHIFT)) & RNG_COUNTER_VAL_CLK_RATIO_MASK)

#define RNG_COUNTER_VAL_REFRESH_CNT_MASK         (0x3FFF00U)
#define RNG_COUNTER_VAL_REFRESH_CNT_SHIFT        (8U)
/*! REFRESH_CNT - Incremented (till max possible value) each time COUNTER was updated since last reading to any *_NUMBER.
 */
#define RNG_COUNTER_VAL_REFRESH_CNT(x)           (((uint32_t)(((uint32_t)(x)) << RNG_COUNTER_VAL_REFRESH_CNT_SHIFT)) & RNG_COUNTER_VAL_REFRESH_CNT_MASK)
/*! @} */

/*! @name COUNTER_CFG -  */
/*! @{ */

#define RNG_COUNTER_CFG_MODE_MASK                (0x3U)
#define RNG_COUNTER_CFG_MODE_SHIFT               (0U)
/*! MODE - 00: disabled 01: update once.
 */
#define RNG_COUNTER_CFG_MODE(x)                  (((uint32_t)(((uint32_t)(x)) << RNG_COUNTER_CFG_MODE_SHIFT)) & RNG_COUNTER_CFG_MODE_MASK)

#define RNG_COUNTER_CFG_CLOCK_SEL_MASK           (0x1CU)
#define RNG_COUNTER_CFG_CLOCK_SEL_SHIFT          (2U)
/*! CLOCK_SEL - Selects the internal clock on which to compute statistics.
 */
#define RNG_COUNTER_CFG_CLOCK_SEL(x)             (((uint32_t)(((uint32_t)(x)) << RNG_COUNTER_CFG_CLOCK_SEL_SHIFT)) & RNG_COUNTER_CFG_CLOCK_SEL_MASK)

#define RNG_COUNTER_CFG_SHIFT4X_MASK             (0xE0U)
#define RNG_COUNTER_CFG_SHIFT4X_SHIFT            (5U)
/*! SHIFT4X - To be used to add precision to clock_ratio and determine 'entropy refill'.
 */
#define RNG_COUNTER_CFG_SHIFT4X(x)               (((uint32_t)(((uint32_t)(x)) << RNG_COUNTER_CFG_SHIFT4X_SHIFT)) & RNG_COUNTER_CFG_SHIFT4X_MASK)
/*! @} */

/*! @name ONLINE_TEST_CFG -  */
/*! @{ */

#define RNG_ONLINE_TEST_CFG_ACTIVATE_MASK        (0x1U)
#define RNG_ONLINE_TEST_CFG_ACTIVATE_SHIFT       (0U)
/*! ACTIVATE - 0: disabled 1: activated Update rythm for VAL depends on COUNTER_CFG if data_sel is set to COUNTER.
 */
#define RNG_ONLINE_TEST_CFG_ACTIVATE(x)          (((uint32_t)(((uint32_t)(x)) << RNG_ONLINE_TEST_CFG_ACTIVATE_SHIFT)) & RNG_ONLINE_TEST_CFG_ACTIVATE_MASK)

#define RNG_ONLINE_TEST_CFG_DATA_SEL_MASK        (0x6U)
#define RNG_ONLINE_TEST_CFG_DATA_SEL_SHIFT       (1U)
/*! DATA_SEL - Selects source on which to apply online test: 00: LSB of COUNTER: raw data from one
 *    or all sources of entropy 01: MSB of COUNTER: raw data from one or all sources of entropy 10:
 *    RANDOM_NUMBER 11: ENCRYPTED_NUMBER 'activate' should be set to 'disabled' before changing this
 *    field.
 */
#define RNG_ONLINE_TEST_CFG_DATA_SEL(x)          (((uint32_t)(((uint32_t)(x)) << RNG_ONLINE_TEST_CFG_DATA_SEL_SHIFT)) & RNG_ONLINE_TEST_CFG_DATA_SEL_MASK)
/*! @} */

/*! @name ONLINE_TEST_VAL -  */
/*! @{ */

